# Homework 1

# Part 1: Python Intro

For this part, you will have more exercises to get more familar with Python. Just go along with this notebook and try to complete the instructions or answer the questions using your Python skills!

In [1]:
x=[1,2,3,4]

** Generate the following list from the above list 'x' by using 'list comprehension'. (Refer to the following link for more detail: https://www.pythonforbeginners.com/basics/list-comprehensions-in-python) **

In [2]:
[i**2 for i in x]

[1, 4, 9, 16]

In [3]:
li = [3, 6, 2, 7, 1, 9]

** Generate the following list from the above list 'li' **

In [4]:
[i*2 for i in li if i >= 6]

[12, 14, 18]

** Split this string:**

    s = "Hi there Sam!"
    
**into a list. **

In [5]:
s = "Hi there Sam!"
s.split()

['Hi', 'there', 'Sam!']

** Given the variables:**

    planet = "Earth"
    diameter = 12742

** Use .format() to print the following string: **

    The diameter of Earth is 12742 kilometers.

In [6]:
planet = "Earth"
diameter = 12742
print('The diameter of {} is {} kilometers.'.format(planet, str(diameter)))

The diameter of Earth is 12742 kilometers.

** Create a function that grabs the email website domain from a string in the form: **

    user@domain.com
    
**So for example, passing "user@domain.com" would return: domain.com**

In [9]:
def returndomain(str):
    return str.split('@')[-1]
returndomain("user@domain.com")

'domain.com'

** Create a basic function that returns True if the word 'dog' is contained in the input string. Don't worry about edge cases like a punctuation being attached to the word dog, but do account for capitalization. **
**So for example, passing "Is there a dog here?" would return: True**

In [10]:
def havedog(str):
    if 'dog' in str.lower().split():
        return True
    else:
        return False
havedog("Is there a dog here?")

True

# Part 2: More about Numpy and Pandas

** For this part you will use Numpy and Pandas to answer each question. **

** Import numpy and pandas **

In [1]:
import numpy as np
import pandas as pd

## DataFrame basics

** Consider the following Python dictionary data and Python list labels: **

In [2]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'], 'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3], 'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

** Create a DataFrame df from this dictionary data which has the index labels. **

In [3]:
df=pd.DataFrame(data,labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**Display a summary of the basic information about this DataFrame and its data.**

In [4]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

** Return the first 3 rows of the DataFrame df. **

In [5]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

**Select just the 'animal' and 'age' columns from the DataFrame df.**

In [6]:
df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].**

In [7]:
# assume that [3,4,8] is the index of rows
df.iloc[[3,4,8],:2]
# df.loc[['d','e','i'],['animal','age']]  alternative

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

**Select only the rows where the number of visits is greater than 3.**

In [8]:
df[df['visits']>3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

**Select the rows where the age is missing, i.e. is NaN.**

In [9]:
# df[df['age']==np.nan] Doesn't work,why?
df[np.isnan(df['age'])==True]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

**Select the rows where the animal is a cat and the age is less than 3.**

In [10]:
df[np.logical_and(df['animal']=='cat',df['age']<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

**Select the rows where the age is between 2 and 4 (inclusive).**

In [11]:
df[np.logical_and(df['age']>=2,df['age']<=4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

**Change the age in row 'f' to 1.5.**

In [12]:
df.loc['f','age']=1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**Calculate the sum of all visits (the total number of visits).**

In [13]:
df['visits'].sum()

19

**Calculate the mean age for each different animal in df.**

In [14]:
# ignore the rows that has value of NaN 
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

**Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [15]:
# data = {'animal': 'cat', 'age':1, 'visits':3, 'priority': 'yes'}
# labels = ['k']
# df2 = pd.DataFrame(data,labels)
# df=df.append(df2)
df=df.append(pd.DataFrame({'animal': 'cat', 'age':1, 'visits':3, 'priority': 'yes'},['k']))
df.drop('k', inplace=True)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**Count the number of each type of animal in df.**

In [16]:
df['animal'].value_counts()

cat      4
dog      4
snake    2
Name: animal, dtype: int64

**Sort df first by the values in the 'age' in decending order, then by the value in the 'visit' column in ascending order.**

In [17]:
df.sort_values('age',ascending=False).sort_values('visits')

  animal  age  visits priority
g  snake  4.5       1       no
j    dog  3.0       1       no
a    cat  2.5       1      yes
h    cat  NaN       1      yes
i    dog  7.0       2       no
e    dog  5.0       2       no
c  snake  0.5       2       no
b    cat  3.0       3      yes
f    cat  1.5       3       no
d    dog  NaN       3      yes

**The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.**

In [28]:
df['priority'].replace(['yes','no'],[True,False],inplace=True)
df

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  1.5       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

In [18]:
df['priority']=df['priority'].apply(lambda x: True if x=='yes' else False)
df

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  1.5       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

**In the 'animal' column, change the 'snake' entries to 'python'.**

In [29]:
df['animal'].replace('snake','python',inplace=True)
df

   animal  age  visits  priority
a     cat  2.5       1      True
b     cat  3.0       3      True
c  python  0.5       2     False
d     dog  NaN       3      True
e     dog  5.0       2     False
f     cat  1.5       3     False
g  python  4.5       1     False
h     cat  NaN       1      True
i     dog  7.0       2     False
j     dog  3.0       1     False

## DataFrames: beyond the basics

**The previous section was tour through some basic but essential DataFrame operations. Below are some ways that you might need to cut your data, but for which there is no single "out of the box" method.**

 You have a DataFrame df with a column 'A' of integers. For example:

In [44]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

**How do you filter out rows which contain the same integer as the row immediately above?**

In [45]:
df[[df.iloc[i]==df.iloc[i-1] for i in list(df.index)]]

    A
2   2
6   5
7   5
10  7

Given a DataFrame of numeric values, say

In [46]:
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
df

          0         1         2
0  0.920189  0.032593  0.409916
1  0.341580  0.746410  0.815666
2  0.960679  0.669021  0.843381
3  0.942865  0.908207  0.030961
4  0.352628  0.102392  0.012489

In [47]:
df.mean(axis=1)

0    0.454232
1    0.634552
2    0.824360
3    0.627345
4    0.155836
dtype: float64

**how do you subtract the row mean from each element in the row?**

In [48]:
for i in range(5):
    df.iloc[i]=df.iloc[i]-df.iloc[i].mean()
df

          0         1         2
0  0.465956 -0.421640 -0.044316
1 -0.292972  0.111858  0.181114
2  0.136319 -0.155340  0.019021
3  0.315521  0.280862 -0.596383
4  0.196792 -0.053445 -0.143348

Suppose you have DataFrame with 10 columns of real numbers, for example:

In [49]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.510196,0.108654,0.861352,0.498321,0.583184,0.255534,0.194030,0.620252,0.819037,0.941768
1,0.318350,0.599312,0.341753,0.394466,0.416468,0.900082,0.135546,0.295113,0.953626,0.725507
2,0.016905,0.942339,0.584515,0.968887,0.135112,0.503059,0.015931,0.338705,0.142385,0.154756
3,0.938510,0.064062,0.755132,0.303531,0.870263,0.381377,0.922759,0.613852,0.717940,0.708855
4,0.093231,0.415307,0.868207,0.306102,0.617125,0.552393,0.771418,0.095485,0.838640,0.433854

** Which column of numbers has the smallest sum? (Find that column's label.)**

In [50]:
df.loc[:,[df[i].sum(axis=0)==df.sum(axis=0).min() for i in 'abcdefghij']].columns

Index(['a'], dtype='object')

** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?**

In [51]:
df=pd.DataFrame({'A': [1, 1, 2, 2, 3, 4],'B':[2, 2, 3, 3, 4, 5]})
len(df.drop_duplicates().index)

4

**A DataFrame has a column of groups 'grps' and and column of numbers 'vals'. For example:**

In [52]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

** For each group, find the sum of the three greatest values.**

In [53]:
# df.sort_values('vals', ascending=False).sort_values('grps')
for g in list(df['grps'].drop_duplicates()):
    print(g, ':',df[df['grps']==g].nlargest(3, columns='vals').sum()['vals'])

a : 409
b : 156
c : 345

## Cleaning Data

### Making a DataFrame easier to work with

**It happens all the time: someone gives you data containing malformed strings and missing data. How do you tidy it up so you can get on with the analysis?**
<br><br>
**Consider the DataFrame to use in the following puzzles:**

In [3]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).**

In [4]:
df['FlightNumber']=df['FlightNumber'].interpolate().astype('int')
# df['FlightNumber']=df['FlightNumber'].fillna({1:10055,3:10075}).astype('int')
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

** The From\_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame. **

In [83]:
df1=df['From_To'].str.split(pat='_', expand=True).rename(columns={0:'From',1:'To'})
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)**

In [84]:
df1['From']=df1['From'].str.capitalize()
df1['To']=df1['To'].str.capitalize()
df1

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

** Delete the From_To column from df and attach the temporary DataFrame from the previous questions.**

In [85]:
df=df.drop('From_To', axis=1)
df=pd.concat([df,df1], axis=1)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

** In the Airline column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. '(British Airways. )' should become 'British Airways'.**

In [86]:
df['Airline']=df['Airline'].str.replace(r'[<>()."!1234567890]',' ').str.strip()
df

   FlightNumber  RecentDelays          Airline      From         To
0         10045      [23, 47]              KLM    London      Paris
1         10055            []       Air France    Madrid      Milan
2         10065  [24, 43, 87]  British Airways    London  Stockholm
3         10075          [13]       Air France  Budapest      Paris
4         10085      [67, 32]        Swiss Air  Brussels     London

**In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.**

**Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.**

In [87]:
li=[]
max_len=max([len(i) for i in df['RecentDelays'].values])
col=['delay_'+str(i+1) for i in range(max_len)]
for i in df['RecentDelays'].values:
    while len(i)<max_len:
        i.append(np.nan)
    li.append(i)
delays=pd.DataFrame(li, columns=col)

df=pd.concat([df,delays],axis=1).drop('RecentDelays', axis=1)
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN

In [59]:
# alternative
max_len=max([len(i) for i in df['RecentDelays'].values])
col=['delay_'+str(i+1) for i in range(max_len)]
delays=pd.DataFrame(np.zeros(len(df.index)*no_delays).reshape(len(df.index),max_len),columns=col)
for idx, con in df[['RecentDelays']].iterrows():
    for j in range(max_len):
         try:
            index='delay_'+str(j+1)
            delays.loc[idx,index]=con['RecentDelays'][j]
         except:
            delays.loc[idx,index]=np.nan

df=pd.concat([df,delays],axis=1).drop('RecentDelays', axis=1)

In [88]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN

The DataFrame should look much better now.

### Great Job!